var data = { "products" : [
    {
        "productId": "8b051a82-e051-11e4-afe5-00259036a192",
        "code": "00000142709",
        "title": "Плитка облицовочная Сан-Ремо 7 200х200х7 мм белая (26 шт=1.04 кв.м)",
        "description": "Предназначена для облицовки стен внутри жилых (кухня, ванная комната, туалет и пр.) и коммерческих (магазины, кафе, отели и пр.) помещений.\n\nТон (оттенок) может отличаться от партии к партии.\n\nСостав: огнеупорная глина, пылевой шпат, кварцевый песок, каолин, красители, фритта.\n\nСтепень блеска: глянцевый.\nКоличество на поддоне: 96 коробок.\nПроизводитель: ОАО «Керамин», Беларусь.\n\nСопутствующие: клей для плитки, крестики, затирка для швов, плиткорез.\n",
        "primaryImageUrl": "//tdp.ru/images/p/cd9/3ef76-fbad-11e4-afe5-00259036a192.jpg",
        "assocProducts": "клей для плитки;\nкрестики;\nзатирка для швов;\nплиткорез;",
        "weight": 13600,
        "unit": "упак.",
        "unitFull": "упаковка",
        "unitRatio": 1,
        "unitAlt": "м. кв.",
        "unitRatioAlt": 0.9615,
        "unitFullAlt": "метр квадратный",
        "priceRetail": 593,
        "priceRetailAlt": 570.1695,
        "priceGold": 576,
        "priceGoldAlt": 553.824,
        "bonusAmount": 0,
        "hasAlternateUnit": true,
        "isActive": true,
        "modified": "2016-10-27 09:58:16"
    },
    {
        "productId": "dded02e3-135e-11e5-b9a9-00259036a192",
        "code": "00000145471",
        "title": "Керамогранит Zula 600х600х10 мм бежевый травертин полированный (4 шт= 1.44 кв.м)",
        "description": "Предназначен для укладки внутри помещений, в том числе с  высокой проходимостью, а так же для наружных работ, для облицовки фасадов и др. \n\nТон (оттенок) и калибр (точность размеров по длине и ширине) может отличаться от партии к партии.\n\nСостав: огнеупорная глина, кварцевый песок, пигменты.\n\nСтепень блеска: матовый.\nКоличество на поддоне: 40 коробок.\nПроизводитель: Китай.\n\nСопутствующие: клей для керамогранита; крестики; затирка для швов; плиткорез; крестики для плитки; затирка для швов; плиткорез;\n\n",
        "primaryImageUrl": "//tdp.ru/images/p/dc8/f086d-3073-11e5-b9a9-00259036a192.jpg",
        "assocProducts": "клей для керамогранита; крестики; затирка для швов; плиткорез;; крестики для плитки; затирка для швов; плиткорез;",
        "weight": 33000,
        "unit": "упак.",
        "unitFull": "упаковка",
        "unitRatio": 1,
        "unitAlt": "м. кв.",
        "unitRatioAlt": 0.69444,
        "unitFullAlt": "метр квадратный",
        "priceRetail": 1336,
        "priceRetailAlt": 927.7718,
        "priceGold": 1283,
        "priceGoldAlt": 890.9665,
        "bonusAmount": 0,
        "hasAlternateUnit": true,
        "isActive": true,
        "modified": "2016-11-02 12:57:00"
    },
    {
        "productId": "5a26045c-0a0c-11e6-bed3-00259036a192",
        "code": "00000156521",
        "title": "Плитка бордюр 400х30 мм Вилланелла белый",
        "description": "Предназначена для использования в качестве декоративного элемента, применение которого позволяет украсить облицовываемую поверхность разнообразными узорами и орнаментами.\n \nТон (оттенок) может отличаться от партии к партии.\n\nСостав: огнеупорная глина, песок, известняк, пигменты.\n\nСтепень блеска: глянцевый\nКоличество в упаковке: 22 шт.\nПроизводитель: KERAMA MARAZZI, Россия\n\nСопутствующие: клей для плитки, крестики, затирка для швов, плиткорез.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
        "primaryImageUrl": "//tdp.ru/images/p/c57/352c8-0a0c-11e6-bed3-00259036a192.jpg",
        "assocProducts": "клей для плитки;\nкрестики;\nзатирка для швов;\nплиткорез;",
        "weight": 300,
        "unit": "шт.",
        "unitFull": "штука",
        "unitRatio": 1,
        "unitAlt": "шт.",
        "unitRatioAlt": 1,
        "unitFullAlt": "штука",
        "priceRetail": 115,
        "priceRetailAlt": 115,
        "priceGold": 111,
        "priceGoldAlt": 111,
        "bonusAmount": 0,
        "hasAlternateUnit": true,
        "isActive": true,
        "modified": "2016-10-27 10:05:08"
    },
    {
        "productId": "19d7362b-70d6-11e5-9d89-00259036a192",
        "code": "00000148058",
        "title": "Плитка настенная Natali 250х330х7 мм белый (18 шт=1.49 кв.м)",
        "description": "Предназначена для облицовки стен внутри жилых (кухня, ванная комната, туалет и пр.) и коммерческих (магазины, кафе, отели и пр.) помещений.\n\nТон (оттенок) может отличаться от партии к партии.\nСостав: огнеупорная глина, песок, известняк, пигменты. \n\nСтепень блеска:матовая\nКоличество на поддоне: 54 коробки .\nПроизводитель: LASSElSBERGER, Россия\n\nСопутствующие: клей для плитки, крестики, затирка для швов, плиткорез.\n\n",
        "primaryImageUrl": "//tdp.ru/images/p/96f/31ac9-70d6-11e5-9d89-00259036a192.JPG",
        "assocProducts": "клей для плитки;\nкрестики;\nзатирка для швов;\nплиткорез;",
        "weight": 17900,
        "unit": "упак.",
        "unitFull": "упаковка",
        "unitRatio": 1,
        "unitAlt": "м. кв.",
        "unitRatioAlt": 0.67114,
        "unitFullAlt": "метр квадратный",
        "priceRetail": 743,
        "priceRetailAlt": 498.657,
        "priceGold": 714,
        "priceGoldAlt": 479.194,
        "bonusAmount": 0,
        "hasAlternateUnit": true,
        "isActive": true,
        "modified": "2016-10-27 09:53:49"
    },
    {
        "productId": "46751ca7-ecdd-11e4-afe5-00259036a192",
        "code": "00000144103",
        "title": "Плитка облицовочная Мираж 200х300х7 мм верх (24 шт=1.44 кв.м)",
        "description": "Предназначена для облицовки стен внутри жилых (кухня, ванная комната, туалет и пр.) и коммерческих (магазины, кафе, отели и пр.) помещений.\n\nТон (оттенок) может отличаться от партии к партии.\n\nСостав: огнеупорная глина, песок, известняк, пигменты.\n\nСтепень блеска: глянцевый.\nКоличество на поддоне: 54 коробок.\nПроизводитель: ОAО «ВКЗ», Россия.\n\nСопутствующие: клей для плитки, крестики, затирка для швов, плиткорез.\n\n",
        "primaryImageUrl": "//tdp.ru/images/p/19b/1dd48-fbc6-11e4-afe5-00259036a192.jpg",
        "assocProducts": "клей для плитки;\nкрестики;\nзатирка для швов;\nплиткорез;",
        "weight": 16490,
        "unit": "упак.",
        "unitFull": "упаковка",
        "unitRatio": 1,
        "unitAlt": "м. кв.",
        "unitRatioAlt": 0.69444,
        "unitFullAlt": "метр квадратный",
        "priceRetail": 409,
        "priceRetailAlt": 284.026,
        "priceGold": 397,
        "priceGoldAlt": 275.6927,
        "bonusAmount": 0,
        "hasAlternateUnit": true,
        "isActive": true,
        "modified": "2016-10-27 09:58:22"
    },
    {
        "productId": "1f2f144c-3fea-11e5-b9a9-00259036a192",
        "code": "00000146668",
        "title": "Плитка декор Relax 250х400х8 мм зеленый №2 494321",
        "description": "ПАННО СОСТОИТ из 4 позиций:\nПлитка декор 250х400х8 мм Релакс зеленый №1 494311\nПлитка декор 250х400х8 мм Релакс зеленый №2 494321\nПлитка декор 250х400х8 мм Релакс зеленый №3 494331\nПлитка декор 250х400х8 мм Релакс зеленый №4 494341\n\nПредназначена для использования в качестве декоративного элемента, применение которого позволяет украсить облицовываемую поверхность разнообразными узорами и орнаментами.\n\nТон (оттенок) может отличаться от партии к партии.\n\nСостав: огнеупорная глина, песок, известняк, пигменты.\n\nСтепень блеска: глянцевая\nКоличество в упаковке: 6 шт.\nПроизводитель: GOLDEN TILE, Украина\n\nСопутствующие: клей для плитки, крестики, затирка для швов, плиткорез.",
        "primaryImageUrl": "//tdp.ru/images/p/cbb/ed1f4-8eb9-11e5-bed3-00259036a192.jpg",
        "assocProducts": "клей для плитки;\nкрестики;\nзатирка для швов;\nплиткорез;",
        "weight": 1430,
        "unit": "шт.",
        "unitFull": "штука",
        "unitRatio": 1,
        "unitAlt": "шт.",
        "unitRatioAlt": 1,
        "unitFullAlt": "штука",
        "priceRetail": 627,
        "priceRetailAlt": 627,
        "priceGold": 609,
        "priceGoldAlt": 609,
        "bonusAmount": 0,
        "hasAlternateUnit": true,
        "isActive": true,
        "modified": "2016-10-27 09:59:32"
    }
    ]};

var obj = data.products;
var supportProducts = obj[0].assocProducts.split('\n');


console.log(obj);
console.log(supportProducts);


var VueJS = new Vue ({
    el: '#app',
    data: {
        isActiveOne: true,
        isActiveTwo: false,
        jsonFile: obj,
        supportProductsVue: obj[0].assocProducts.split('\n'),

    },
    computed: {
         showMess() {
            if (this.list.bonusAmount == 0) {
                  this.list.bonusAmount += 1;
                } else {
                  this.list.bonusAmount -= 1;
                }
         }
    }
});

